In [1]:
# check if insludes '2017-01-01 00:00:00'

In [22]:
import sqlite3
import pandas as pd

In [23]:
conn = sqlite3.connect('10a_between_check.db')

In [24]:
data1 = pd.date_range('2015-01-01 10:00:00', '2018-01-01 10:00:00')

In [25]:
data1

DatetimeIndex(['2015-01-01 10:00:00', '2015-01-02 10:00:00',
               '2015-01-03 10:00:00', '2015-01-04 10:00:00',
               '2015-01-05 10:00:00', '2015-01-06 10:00:00',
               '2015-01-07 10:00:00', '2015-01-08 10:00:00',
               '2015-01-09 10:00:00', '2015-01-10 10:00:00',
               ...
               '2017-12-23 10:00:00', '2017-12-24 10:00:00',
               '2017-12-25 10:00:00', '2017-12-26 10:00:00',
               '2017-12-27 10:00:00', '2017-12-28 10:00:00',
               '2017-12-29 10:00:00', '2017-12-30 10:00:00',
               '2017-12-31 10:00:00', '2018-01-01 10:00:00'],
              dtype='datetime64[ns]', length=1097, freq='D')

In [26]:
data2 = pd.date_range('2015-01-01 00:00:00', '2018-01-01 00:00:00')

In [27]:
data2

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06', '2015-01-07', '2015-01-08',
               '2015-01-09', '2015-01-10',
               ...
               '2017-12-23', '2017-12-24', '2017-12-25', '2017-12-26',
               '2017-12-27', '2017-12-28', '2017-12-29', '2017-12-30',
               '2017-12-31', '2018-01-01'],
              dtype='datetime64[ns]', length=1097, freq='D')

In [28]:
df1 = pd.DataFrame(data1, columns=['Col1'])

In [29]:
df1

                    Col1
0    2015-01-01 10:00:00
1    2015-01-02 10:00:00
2    2015-01-03 10:00:00
3    2015-01-04 10:00:00
4    2015-01-05 10:00:00
...                  ...
1092 2017-12-28 10:00:00
1093 2017-12-29 10:00:00
1094 2017-12-30 10:00:00
1095 2017-12-31 10:00:00
1096 2018-01-01 10:00:00

[1097 rows x 1 columns]

In [30]:
df = df1.append(pd.DataFrame(data2, columns=['Col1']))

In [31]:
df

                    Col1
0    2015-01-01 10:00:00
1    2015-01-02 10:00:00
2    2015-01-03 10:00:00
3    2015-01-04 10:00:00
4    2015-01-05 10:00:00
...                  ...
1092 2017-12-28 00:00:00
1093 2017-12-29 00:00:00
1094 2017-12-30 00:00:00
1095 2017-12-31 00:00:00
1096 2018-01-01 00:00:00

[2194 rows x 1 columns]

In [33]:
df.to_sql(name = 'Tab1', con=conn)

In [39]:
pd.read_sql_query(sql = '''
SELECT *
FROM Tab1
WHERE Col1 BETWEEN '2016-01-01' AND '2017-01-01'
ORDER BY Col1 DESC;
''', con = conn)

     index                 Col1
0      730  2016-12-31 10:00:00
1      730  2016-12-31 00:00:00
2      729  2016-12-30 10:00:00
3      729  2016-12-30 00:00:00
4      728  2016-12-29 10:00:00
..     ...                  ...
727    367  2016-01-03 00:00:00
728    366  2016-01-02 10:00:00
729    366  2016-01-02 00:00:00
730    365  2016-01-01 10:00:00
731    365  2016-01-01 00:00:00

[732 rows x 2 columns]

In [40]:
pd.read_sql_query(sql = '''
SELECT *
FROM Tab1
WHERE Col1 BETWEEN '2016-01-01' AND '2017-01-01 00:00:00'
ORDER BY Col1 DESC;
''', con = conn)

     index                 Col1
0      731  2017-01-01 00:00:00
1      730  2016-12-31 10:00:00
2      730  2016-12-31 00:00:00
3      729  2016-12-30 10:00:00
4      729  2016-12-30 00:00:00
..     ...                  ...
728    367  2016-01-03 00:00:00
729    366  2016-01-02 10:00:00
730    366  2016-01-02 00:00:00
731    365  2016-01-01 10:00:00
732    365  2016-01-01 00:00:00

[733 rows x 2 columns]